{
  "_commit_hash": "05e4a8c109040e04cef0df82f2dbe36970a4c44c",
  "_name_or_path": "jinaai/jina-clip-v1",
  "add_projections": false,
  "architectures": [
    "JinaCLIPModel"
  ],
  "auto_map": {
    "AutoConfig": "jinaai/jina-clip-implementation--configuration_clip.JinaCLIPConfig",
    "AutoModel": "jinaai/jina-clip-implementation--modeling_clip.JinaCLIPModel"
  },
  "initializer_factor": 1.0,
  "logit_scale_init_value": 2.6592,
  "matryoshka_dimensions": null,
  "model_type": "jina_clip",
  "projection_dim": 768,
  "text_config": {
    "_attn_implementation_autoset": false,
    "_name_or_path": "",
    "add_cross_attention": false,
    "architectures": null,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "default_instruction_task": null,
    "default_lora_task": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "early_stopping": false,
    "embed_dim": 768,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": null,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "hf_model_config_kwargs": {
      "use_flash_attn": false
    },
    "hf_model_name_or_path": "jinaai/jina-bert-flash-implementation",
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "length_penalty": 1.0,
    "max_length": 20,
    "min_length": 0,
    "model_type": "jina_clip_text",
    "no_repeat_ngram_size": 0,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "pooler_type": "mean_pooler",
    "prefix": null,
    "problem_type": null,
    "proj_bias": false,
    "proj_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": null,
    "torchscript": false,
    "transformers_version": "4.47.1",
    "typical_p": 1.0,
    "use_bfloat16": false
  },
  "torch_dtype": "float32",
  "transformers_version": null,
  "truncate_dim": null,
  "use_text_flash_attn": false,
  "use_vision_xformers": false,
  "vision_config": {
    "_attn_implementation_autoset": false,
    "_name_or_path": "",
    "add_cross_attention": false,
    "architectures": null,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "drop_path_rate": 0.0,
    "early_stopping": false,
    "embed_dim": 768,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": null,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "fused_layer_norm": false,
    "head_width": 64,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "image_size": 224,
    "intp_freq": false,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "layers": 12,
    "length_penalty": 1.0,
    "ls_init_value": null,
    "max_length": 20,
    "min_length": 0,
    "mlp_ratio": 2.6667,
    "model_type": "jina_clip_vision",
    "naive_swiglu": true,
    "no_repeat_ngram_size": 0,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "patch_dropout": 0.1,
    "patch_size": 16,
    "post_norm": false,
    "prefix": null,
    "problem_type": null,
    "proj_type": null,
    "pruned_heads": {},
    "pt_hw_seq_len": 14,
    "qkv_bias": true,
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "rope_embeddings": true,
    "sep_token_id": null,
    "subln": true,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": null,
    "torchscript": false,
    "transformers_version": "4.47.1",
    "typical_p": 1.0,
    "use_bfloat16": false,
    "width": 768,
    "x_attention": false
  }
}
